
#Область ПрограммныйИнтерфейс

#Если Клиент Тогда
	
Процедура ПриИзмененииРеквизитаУниверсальный(Элемент, Форма) Экспорт
		
КонецПроцедуры

Процедура ПриНачалеРедактированияТЧУниверсальный(Элемент, НоваяСтрока, Копирование, Форма) Экспорт
	
КонецПроцедуры

Процедура ПриИзмененииТЧУниверсальный(Элемент, Форма) Экспорт
	
КонецПроцедуры


Процедура НачалоВыбораРеквизитаУниверсальный(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма = Неопределено) Экспорт
				
КонецПроцедуры

Процедура ВыборСпискаУниверсальный(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, Форма = Неопределено) Экспорт
		
КонецПроцедуры

Процедура ОбработатьКоманду(Команда, Форма) Экспорт
	
КонецПроцедуры

Процедура НажатиеУниверсальный(Элемент, Форма, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры

Процедура ОбработчикВыбораСсылкиИзСписка(Результат, ДопПараметры, ПродолжитьВызов) Экспорт
		
КонецПроцедуры

#ИначеЕсли Сервер Тогда

	

#КонецЕсли

#КонецОбласти

////////////////////////////////////////////////////////////
////// ДОПОЛНИТЕЛЬНЫЕ ОБРАБОТЧИКИ

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
