#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БЛС_БлочныеТаблицыФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКоманд

&НаКлиенте
Процедура БЛС_БлочныеТаблицыФормОбработчикКоманд(Команда)
	БЛС_БлочныеТаблицыФормОбработчикКомандНаСервере(Команда.Имя);	
КонецПроцедуры 

&НаСервере
Процедура БЛС_БлочныеТаблицыФормОбработчикКомандНаСервере(ИмяКоманды)
	БЛС_БлочныеТаблицыФорм.ОбработкаКоманды(ЭтаФорма, Элементы.Найти(ИмяКоманды) );	
КонецПроцедуры


&НаКлиенте
Процедура ПереключитьОтображение(Команда)
	
	ПереключитьОтображениеНаСервере("ТестоваяТаблица");	
	
КонецПроцедуры   

&НаСервере
Процедура ПереключитьОтображениеНаСервере(ИмяТаблицы)	
	БЛС_БлочныеТаблицыФорм.ПереключитьОтображениеТаблицы(ЭтаФорма, ИмяТаблицы);	
КонецПроцедуры

#КонецОбласти

