#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ЛС_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	БЛС_ФормыИнтерфейс.ДополнитьФормуТолькоРеквизитами(ЭтаФорма);
	// Данная процедуры вызывается после отработки типовой логики основной конфигурации
	ЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ЛС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	БЛС_ФормыИнтерфейс.ДополнитьФормуПолями(ЭтаФорма);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЛС_ОбработчикКоманды(Команда)
	БЛС_ФормыОбработчики.ОбработатьКоманду(Команда, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПрограммноеДобавлениеЭлементов(Команда)
	ПрограммноеДобавлениеЭлементовНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ЛС_ОбработчикПриИзменении(Элемент)
	БЛС_ФормыОбработчики.ПриИзмененииРеквизитаУниверсальный(Элемент, ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ЛС_ОбработчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БЛС_ФормыОбработчики.НачалоВыбораРеквизитаУниверсальный(Элемент, ДанныеВыбора, СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ЛС_Нажатие(Элемент, СтандартнаяОбработка)
	БЛС_ФормыОбработчики.НажатиеУниверсальный(Элемент, ЭтаФорма, СтандартнаяОбработка);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрограммноеДобавлениеЭлементовНаСервере()
	
	БЛС_Формы.ДобДекорацию(ЭтотОбъект, ЭтотОбъект, "БЛС_Декорация", "Моя декорация");	
	
КонецПроцедуры

#КонецОбласти