// Библиотека общих функций по работе с формами в программном режиме
// Версия библиотеки: 26.07.2023
//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриИзмененииРеквизитаУниверсальный(Элемент, Форма) Экспорт

	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыОбработчикиПереопределяемый.ПриИзмененииРеквизитаУниверсальный(Элемент, Форма);

КонецПроцедуры

Процедура ПриНачалеРедактированияТЧУниверсальный(Элемент, НоваяСтрока, Копирование, Форма) Экспорт
	
	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыОбработчикиПереопределяемый.ПриНачалеРедактированияТЧУниверсальный(Элемент, НоваяСтрока, Копирование, Форма);
	
КонецПроцедуры 

Процедура ПриИзмененииТЧУниверсальный(Элемент, Форма) Экспорт
		
	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыОбработчикиПереопределяемый.ПриИзмененииТЧУниверсальный(Элемент, Форма);
	
КонецПроцедуры

Процедура НачалоВыбораРеквизитаУниверсальный(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма) Экспорт

	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыОбработчикиПереопределяемый.НачалоВыбораРеквизитаУниверсальный(Элемент, 
																			ДанныеВыбора,
																			СтандартнаяОбработка,
																			Форма);
	
КонецПроцедуры

Процедура ВыборСпискаУниверсальный(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, Форма) Экспорт

	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыОбработчикиПереопределяемый.ВыборСпискаУниверсальный(Элемент,
																  ВыбраннаяСтрока,
																  Поле,   
																  СтандартнаяОбработка,
																  Форма);
	
КонецПроцедуры

Процедура ОбработатьКоманду(Команда, Форма) Экспорт

	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыОбработчикиПереопределяемый.ОбработатьКоманду(Команда, Форма);   
	Сообщить(Команда.Имя);
	
КонецПроцедуры

Процедура НажатиеУниверсальный(Элемент, Форма, СтандартнаяОбработка) Экспорт

	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыОбработчикиПереопределяемый.НажатиеУниверсальный(Элемент, Форма, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработчикВыбораСсылкиИзСписка(Результат, ДопПараметры) Экспорт

	// Дополнительные обработчики при наследовании расширения
	ПродолжитьВызов = Истина;
	БЛС_ФормыОбработчикиПереопределяемый.ОбработчикВыбораСсылкиИзСписка(Результат, ДопПараметры, ПродолжитьВызов);
	Если ПродолжитьВызов Тогда
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
