// Библиотека общих функций по работе с формами в программном режиме
// Версия библиотеки: 26.07.2023
//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьФормуРеквизитами(Форма, МассивНовыхРеквизитов) Экспорт
	
	Если Найти(Форма.ИмяФормы, "Организации") Тогда
		Если БЛС_Формы.ЭтоФормаВыбора(Форма) Тогда
			ТестоваяФормаДобавитьРеквизиты(Форма, МассивНовыхРеквизитов);
		ИначеЕсли БЛС_Формы.ЭтоФормаЭлемента(Форма) Тогда
			ТестоваяФормаДобавитьРеквизиты(Форма, МассивНовыхРеквизитов);
		КонецЕсли;
	КонецЕсли;
	Если Найти(Форма.ИмяФормы, "БЛС_БиблиотекаФорм.Форма.Пример") Тогда
		ПримерБиблиотекиДобавитьРеквизиты(Форма, МассивНовыхРеквизитов);	
	КонецЕсли;    
	
	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыЭлементыПереопределяемый.ДополнитьФормуРеквизитами(Форма, МассивНовыхРеквизитов);
		
КонецПроцедуры

Процедура ДополнитьФормуПолями(Форма) Экспорт
	
		
	Если Найти(Форма.ИмяФормы, "Организации") Тогда
		Если БЛС_Формы.ЭтоФормаЭлемента(Форма) Тогда
			ТестоваяФормаДополнитьФорму(Форма);	
		ИначеЕсли БЛС_Формы.ЭтоФормаСписка(Форма) Тогда
			ТестоваяФормаДополнитьСписок(Форма);	
		ИначеЕсли БЛС_Формы.ЭтоФормаВыбора(Форма) Тогда
			ТестоваяФормаДополнитьСписок(Форма);	
		КонецЕсли;
	КонецЕсли;
	
	Если Найти(Форма.ИмяФормы, "БЛС_БиблиотекаФорм.Форма.Пример") Тогда
		ПримерБиблиотекиДополнитьФорму(Форма);	
	КонецЕсли;
	
	// Дополнительные обработчики при наследовании расширения
	БЛС_ФормыЭлементыПереопределяемый.ДополнитьФормуПолями(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ДобавлениеРеквизитовФормы

Процедура ТестоваяФормаДобавитьРеквизиты(Форма, МассивНовыхРеквизитов)
	
	БЛС_Формы.НовРеквФормы(Форма, МассивНовыхРеквизитов, "Строка", "БЛС_СтроковыйРеквизит", "Реквизит");
		
КонецПроцедуры

Процедура ПримерБиблиотекиДобавитьРеквизиты(Форма, МассивНовыхРеквизитов)

	БЛС_Формы.НовРеквФормы(Форма, МассивНовыхРеквизитов, "Строка", "БЛС_Строка", "Строка");
	БЛС_Формы.НовРеквФормы(Форма, МассивНовыхРеквизитов, "Число", "БЛС_Число", "Число");
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеПолейФормы

Процедура ТестоваяФормаДополнитьФорму(Форма)
	
	РеквизитРодитель = Форма.Элементы.Найти("РеквизитРодитель");
	ЭлементФормы = БЛС_Формы.ДобПолеВвода(Форма, РеквизитРодитель, "БЛС_СтроковыйРеквизит", "Тестовый элемент", Ложь);
		
КонецПроцедуры

Процедура ТестоваяФормаДополнитьСписок(Форма)

	ЭлементСписок = Форма.Элементы.Найти("Список");
	Список = Форма.Список;
	ЗаменяемыйТекст = 
	"ВЫБРАТЬ
	|	ТестовыйДокумент.Ссылка КАК Ссылка,";
	ТекстПодмены =
	"ВЫБРАТЬ
	|	ТестовыйДокумент.Ссылка КАК Ссылка,
	|	ТестовыйДокумент.БЛС_СтроковыйРеквизит КАК БЛС_СтроковыйРеквизит,";
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, ЗаменяемыйТекст, ТекстПодмены);
	
	СписокСледЭлемент = Форма.Элементы.Найти("СписокРеквизит1");
	БЛС_Формы.ВстКолонкуТаблицы(Форма, ЭлементСписок, "БЛС_СтроковыйРеквизит", "Тестовый элемент", СписокСледЭлемент);
	
КонецПроцедуры

Процедура ПримерБиблиотекиДополнитьФорму(Форма)

	ЭлементГруппы = БЛС_Формы.ДобГруппу(Форма, Форма, "БЛС_ЭлементГруппы");
	ЭлементПодгруппы = БЛС_Формы.ДобГруппу(Форма, ЭлементГруппы, "БЛС_Подгруппа", "Пример подгруппы");
	БЛС_Формы.ДобПолеВвода(Форма, ЭлементПодгруппы, "БЛС_Строка", "Моя строка", Ложь);
	ЭлементФормы = БЛС_Формы.ДобПолеВвода(Форма, ЭлементГруппы, "БЛС_Число");
	ЭлементФормы.Заголовок = "Тестовое число";
	
	ЭлементКнопки = БЛС_Формы.ДобКнопку(Форма, ЭлементГруппы, "БЛС_Кнопка", "Моя кнопка");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти